namespace AbyssalDive {
    /// <summary>
    /// 行动类型枚举
    /// </summary>
    public enum ActionType {
        // 连击类
        连打,
        连斩,
        追击,
        连击延续,
        连击狂热,
        连击终结,
        连击追击,
        连击警戒,
        连击狂暴,
        狂怒猛击,
        倾泻,
        乘胜追击,

        // 击伤类
        戮血,
        截击,

        // 蓄力类
        蓄力,
        凝势,
        盾化,
        连击转化,
        蓄势,
        藏锋,
        聚锋,

        // 护盾类
        举盾,
        架势,
        护盾蓄力,
        护盾强化,
        盾击,
        绝甲,
        护甲猛击,

        // 溃伤类
        溃伤攻击,
        溃伤切割,
        溃伤爆发,
        溃伤传染,
        溃伤吸取,
        溃伤护盾,
        溃伤加深,

        // 基础类
        重击,
        爆发,
        疾风,
        坚壁,
        刺盾,
        狂暴,
        治疗,
        减益冲击,
        猛攻,
        血猎,
        致命,
        镜像
    }
}